In [1]:
import pandas as pd

In [16]:
var = {'Name':['A','B','C'],
      'City':['Nag','Mum','Jab'],
      'Salary':[100,200,300]}

In [27]:
df = pd.DataFrame(var,dtypes = {'Salary':'float'})

TypeError: __init__() got an unexpected keyword argument 'dtypes'

In [24]:
mydata = pd.read_csv('emp.csv',dtype = {'salary':'float'})

In [64]:
mydata.iloc[[2;6]]

SyntaxError: invalid syntax (1541545759.py, line 1)

In [22]:
for i in mydata:
    print(i)

    1   Vikas   1000  30  2017-10-03
0  11  Dennis  41000  30  2024-01-05
1  12   Karan   2200  20  2018-06-16
2  13  Simran   1500  10  2019-12-19
3  14    Amit   2000  30  2022-04-09
4  15    Neha   1700  20  2021-07-22
    1  Vikas  1000  30  2017-10-03
5  16  Rahul  1200  10  2016-03-28

In [43]:
mydata

    eno   ename   salary  deptno         doj
0    10   Amber   1000.0      10  2018-05-14
1     2    Amar   1000.0      10  2017-03-22
2     8   Sagar   1000.0      20  2020-11-30
3     4  Thomas   1000.0      10  2019-08-18
4     5    Jade   2000.0      10  2021-02-10
5     6   Smith   1000.0      10  2016-12-01
6     7  Robert   3000.0      20  2023-06-25
7     3    Nick   1000.0      30  2015-09-15
8     9   Naman   4000.0      30  2020-01-20
9     1   Vikas   1000.0      30  2017-10-03
10   11  Dennis  41000.0      30  2024-01-05
11   12   Karan   2200.0      20  2018-06-16
12   13  Simran   1500.0      10  2019-12-19
13   14    Amit   2000.0      30  2022-04-09
14   15    Neha   1700.0      20  2021-07-22
15   16   Rahul   1200.0      10  2016-03-28

In [34]:
mydata1 = pd.read_csv('emp_1.csv',delimiter =';')

In [35]:
file_read = pd.read_json
pd.read_csv()
pd.read_xml()
pd.read_excel()

                           eno  ename  salary  deptno         doj
0                           10  Amber  1000.0    10.0  2018-05-14
1                            2   Amar  1000.0    10.0  2017-03-22
2                            8  Sagar  1000.0    20.0  2020-11-30
3  4,Thomas,1000,10,2019-08-18    NaN     NaN     NaN         NaN

In [39]:
sal = mydata['salary']==1000

In [51]:
mydata_sal_dep = (mydata['deptno'] == 10) & (mydata['salary'] < 2000)

In [52]:
mydata[mydata_sal_dep]

    eno   ename  salary  deptno         doj
0    10   Amber  1000.0      10  2018-05-14
1     2    Amar  1000.0      10  2017-03-22
3     4  Thomas  1000.0      10  2019-08-18
5     6   Smith  1000.0      10  2016-12-01
12   13  Simran  1500.0      10  2019-12-19
15   16   Rahul  1200.0      10  2016-03-28

In [59]:
mydata_10 != mydata['deptno'] == 10
mydata_20 = mydata['deptno'] == 20

In [57]:
mydata_10_20 = mydata_10 | mydata_20

In [58]:
mydata[mydata_10_20]

    eno   ename  salary  deptno         doj
0    10   Amber  1000.0      10  2018-05-14
1     2    Amar  1000.0      10  2017-03-22
2     8   Sagar  1000.0      20  2020-11-30
3     4  Thomas  1000.0      10  2019-08-18
4     5    Jade  2000.0      10  2021-02-10
5     6   Smith  1000.0      10  2016-12-01
6     7  Robert  3000.0      20  2023-06-25
11   12   Karan  2200.0      20  2018-06-16
12   13  Simran  1500.0      10  2019-12-19
14   15    Neha  1700.0      20  2021-07-22
15   16   Rahul  1200.0      10  2016-03-28

In [60]:
mydata[mydata_10]

Empty DataFrame
Columns: [eno, ename, salary, deptno, doj]
Index: []

In [71]:
mydata_10 = ~mydata['deptno'] == 10

In [73]:
mydata_10_not = ~mydata_10

In [74]:
mydata[mydata_10_not]

    eno   ename   salary  deptno         doj
0    10   Amber   1000.0      10  2018-05-14
1     2    Amar   1000.0      10  2017-03-22
2     8   Sagar   1000.0      20  2020-11-30
3     4  Thomas   1000.0      10  2019-08-18
4     5    Jade   2000.0      10  2021-02-10
5     6   Smith   1000.0      10  2016-12-01
6     7  Robert   3000.0      20  2023-06-25
7     3    Nick   1000.0      30  2015-09-15
8     9   Naman   4000.0      30  2020-01-20
9     1   Vikas   1000.0      30  2017-10-03
10   11  Dennis  41000.0      30  2024-01-05
11   12   Karan   2200.0      20  2018-06-16
12   13  Simran   1500.0      10  2019-12-19
13   14    Amit   2000.0      30  2022-04-09
14   15    Neha   1700.0      20  2021-07-22
15   16   Rahul   1200.0      10  2016-03-28

In [81]:
mydata_30 = ~(mydata['deptno'] == 30)

In [82]:
mydata[mydata_30]

    eno   ename  salary  deptno         doj
0    10   Amber  1000.0      10  2018-05-14
1     2    Amar  1000.0      10  2017-03-22
2     8   Sagar  1000.0      20  2020-11-30
3     4  Thomas  1000.0      10  2019-08-18
4     5    Jade  2000.0      10  2021-02-10
5     6   Smith  1000.0      10  2016-12-01
6     7  Robert  3000.0      20  2023-06-25
11   12   Karan  2200.0      20  2018-06-16
12   13  Simran  1500.0      10  2019-12-19
14   15    Neha  1700.0      20  2021-07-22
15   16   Rahul  1200.0      10  2016-03-28

In [88]:
mydata_sort = mydata.sort_values(by = 'deptno', ascending = False)

In [87]:
mydata_sort

    eno   ename   salary  deptno         doj
7     3    Nick   1000.0      30  2015-09-15
10   11  Dennis  41000.0      30  2024-01-05
9     1   Vikas   1000.0      30  2017-10-03
8     9   Naman   4000.0      30  2020-01-20
13   14    Amit   2000.0      30  2022-04-09
2     8   Sagar   1000.0      20  2020-11-30
6     7  Robert   3000.0      20  2023-06-25
11   12   Karan   2200.0      20  2018-06-16
14   15    Neha   1700.0      20  2021-07-22
4     5    Jade   2000.0      10  2021-02-10
1     2    Amar   1000.0      10  2017-03-22
3     4  Thomas   1000.0      10  2019-08-18
0    10   Amber   1000.0      10  2018-05-14
5     6   Smith   1000.0      10  2016-12-01
12   13  Simran   1500.0      10  2019-12-19
15   16   Rahul   1200.0      10  2016-03-28

In [94]:
mydata.sort_values(by = ['eno'],ascending = False,inplace = True)

In [95]:
mydata

    eno   ename   salary  deptno         doj
15   16   Rahul   1200.0      10  2016-03-28
14   15    Neha   1700.0      20  2021-07-22
13   14    Amit   2000.0      30  2022-04-09
12   13  Simran   1500.0      10  2019-12-19
11   12   Karan   2200.0      20  2018-06-16
10   11  Dennis  41000.0      30  2024-01-05
0    10   Amber   1000.0      10  2018-05-14
8     9   Naman   4000.0      30  2020-01-20
2     8   Sagar   1000.0      20  2020-11-30
6     7  Robert   3000.0      20  2023-06-25
5     6   Smith   1000.0      10  2016-12-01
4     5    Jade   2000.0      10  2021-02-10
3     4  Thomas   1000.0      10  2019-08-18
7     3    Nick   1000.0      30  2015-09-15
1     2    Amar   1000.0      10  2017-03-22
9     1   Vikas   1000.0      30  2017-10-03

In [102]:
mydata_group = mydata.groupby('deptno')['salary'].max().reset_index()

In [103]:
mydata_group

   deptno   salary
0      10   2000.0
1      20   3000.0
2      30  41000.0

In [104]:
mydata_group_sum = mydata.groupby('deptno')['salary'].sum().reset_index()

In [105]:
mydata_group_sum

   deptno   salary
0      10   8700.0
1      20   7900.0
2      30  49000.0

In [111]:
mydata_count = mydata.groupby(['deptno','salary'])['eno'].count().reset_index().rename(columns = {'eno':'emp_count'})

In [112]:
mydata_count

   deptno  emp_count
0      10          7
1      20          4
2      30          5

In [118]:
my_add = mydata.groupby('deptno')['salary'].agg(['sum','min','max','count']).reset_index()

In [121]:
col_name = {'sum':'deptno_sum','min':'dept_min','max':'dept_max','count':'dept_count'}

In [122]:
final_data = my_add.rename(columns = col_name)

In [123]:
final_data

   deptno  deptno_sum  dept_min  dept_max  dept_count
0      10      8700.0    1000.0    2000.0           7
1      20      7900.0    1000.0    3000.0           4
2      30     49000.0    1000.0   41000.0           5

In [129]:
mydata_having = mydata_count.apply(lambda x :x>4)

In [133]:
mydata_count_having = mydata_count[mydata_having].reset_index()

In [136]:
mydata_count_having

   index  deptno  emp_count
0      0      10        7.0
1      1      20        NaN
2      2      30        5.0

In [137]:
df_dept = pd.read_csv('Departments.csv')

In [138]:
df_dept

   deptno deptName
0      10  Finance
1      20       IT
2      30   Travel
3      80    Forex

In [140]:
df_merge = mydata.merge(df_dept,on = 'deptno', how='inner')

In [141]:
df_merge

    eno   ename   salary  deptno         doj deptName
0    16   Rahul   1200.0      10  2016-03-28  Finance
1    15    Neha   1700.0      20  2021-07-22       IT
2    14    Amit   2000.0      30  2022-04-09   Travel
3    13  Simran   1500.0      10  2019-12-19  Finance
4    12   Karan   2200.0      20  2018-06-16       IT
5    11  Dennis  41000.0      30  2024-01-05   Travel
6    10   Amber   1000.0      10  2018-05-14  Finance
7     9   Naman   4000.0      30  2020-01-20   Travel
8     8   Sagar   1000.0      20  2020-11-30       IT
9     7  Robert   3000.0      20  2023-06-25       IT
10    6   Smith   1000.0      10  2016-12-01  Finance
11    5    Jade   2000.0      10  2021-02-10  Finance
12    4  Thomas   1000.0      10  2019-08-18  Finance
13    3    Nick   1000.0      30  2015-09-15   Travel
14    2    Amar   1000.0      10  2017-03-22  Finance
15    1   Vikas   1000.0      30  2017-10-03   Travel

In [142]:
merge_left = mydata.merge(df_dept, on = 'deptno',how ='left')

In [143]:
merge_left

    eno   ename   salary  deptno         doj deptName
0    16   Rahul   1200.0      10  2016-03-28  Finance
1    15    Neha   1700.0      20  2021-07-22       IT
2    14    Amit   2000.0      30  2022-04-09   Travel
3    13  Simran   1500.0      10  2019-12-19  Finance
4    12   Karan   2200.0      20  2018-06-16       IT
5    11  Dennis  41000.0      30  2024-01-05   Travel
6    10   Amber   1000.0      10  2018-05-14  Finance
7     9   Naman   4000.0      30  2020-01-20   Travel
8     8   Sagar   1000.0      20  2020-11-30       IT
9     7  Robert   3000.0      20  2023-06-25       IT
10    6   Smith   1000.0      10  2016-12-01  Finance
11    5    Jade   2000.0      10  2021-02-10  Finance
12    4  Thomas   1000.0      10  2019-08-18  Finance
13    3    Nick   1000.0      30  2015-09-15   Travel
14    2    Amar   1000.0      10  2017-03-22  Finance
15    1   Vikas   1000.0      30  2017-10-03   Travel

In [144]:
merge_right = mydata.merge(df_dept, on='deptno', how ='right')

In [145]:
merge_right

     eno   ename   salary  deptno         doj deptName
0   16.0   Rahul   1200.0      10  2016-03-28  Finance
1   13.0  Simran   1500.0      10  2019-12-19  Finance
2   10.0   Amber   1000.0      10  2018-05-14  Finance
3    6.0   Smith   1000.0      10  2016-12-01  Finance
4    5.0    Jade   2000.0      10  2021-02-10  Finance
5    4.0  Thomas   1000.0      10  2019-08-18  Finance
6    2.0    Amar   1000.0      10  2017-03-22  Finance
7   15.0    Neha   1700.0      20  2021-07-22       IT
8   12.0   Karan   2200.0      20  2018-06-16       IT
9    8.0   Sagar   1000.0      20  2020-11-30       IT
10   7.0  Robert   3000.0      20  2023-06-25       IT
11  14.0    Amit   2000.0      30  2022-04-09   Travel
12  11.0  Dennis  41000.0      30  2024-01-05   Travel
13   9.0   Naman   4000.0      30  2020-01-20   Travel
14   3.0    Nick   1000.0      30  2015-09-15   Travel
15   1.0   Vikas   1000.0      30  2017-10-03   Travel
16   NaN     NaN      NaN      80         NaN    Forex

In [146]:
merge_outer = mydata.merge(df_dept, on ='deptno', how ='outer')

In [147]:
merge_outer

     eno   ename   salary  deptno         doj deptName
0   16.0   Rahul   1200.0      10  2016-03-28  Finance
1   13.0  Simran   1500.0      10  2019-12-19  Finance
2   10.0   Amber   1000.0      10  2018-05-14  Finance
3    6.0   Smith   1000.0      10  2016-12-01  Finance
4    5.0    Jade   2000.0      10  2021-02-10  Finance
5    4.0  Thomas   1000.0      10  2019-08-18  Finance
6    2.0    Amar   1000.0      10  2017-03-22  Finance
7   15.0    Neha   1700.0      20  2021-07-22       IT
8   12.0   Karan   2200.0      20  2018-06-16       IT
9    8.0   Sagar   1000.0      20  2020-11-30       IT
10   7.0  Robert   3000.0      20  2023-06-25       IT
11  14.0    Amit   2000.0      30  2022-04-09   Travel
12  11.0  Dennis  41000.0      30  2024-01-05   Travel
13   9.0   Naman   4000.0      30  2020-01-20   Travel
14   3.0    Nick   1000.0      30  2015-09-15   Travel
15   1.0   Vikas   1000.0      30  2017-10-03   Travel
16   NaN     NaN      NaN      80         NaN    Forex

In [148]:
merge_diff = pd.merge(mydata, df_dept, on='deptno',how='inner')

In [149]:
merge_diff

    eno   ename   salary  deptno         doj deptName
0    16   Rahul   1200.0      10  2016-03-28  Finance
1    15    Neha   1700.0      20  2021-07-22       IT
2    14    Amit   2000.0      30  2022-04-09   Travel
3    13  Simran   1500.0      10  2019-12-19  Finance
4    12   Karan   2200.0      20  2018-06-16       IT
5    11  Dennis  41000.0      30  2024-01-05   Travel
6    10   Amber   1000.0      10  2018-05-14  Finance
7     9   Naman   4000.0      30  2020-01-20   Travel
8     8   Sagar   1000.0      20  2020-11-30       IT
9     7  Robert   3000.0      20  2023-06-25       IT
10    6   Smith   1000.0      10  2016-12-01  Finance
11    5    Jade   2000.0      10  2021-02-10  Finance
12    4  Thomas   1000.0      10  2019-08-18  Finance
13    3    Nick   1000.0      30  2015-09-15   Travel
14    2    Amar   1000.0      10  2017-03-22  Finance
15    1   Vikas   1000.0      30  2017-10-03   Travel